app/controllers/api/v1/companies_controller.rb

	def index
		if params[:name]
			@companies = Company.where('name LIKE ?','%#{params[:name]}')
		else
			@companies = Company.all
---
SELECT `companies`.* FROM `companies` WHERE (name LIKE '%#{params[:name]}%')
SELECT `companies`.* FROM `companies`

	def show
		@company = Company.find(params[:id])
---
SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1