app/controllers/api/v1/users_controller.rb

    def create
      @user = User.create!(sign_up_params)
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `uid`) VALUES ('teste@teste.com', '$2a$11$r8jiW9SVXuwHxEINKsM9k.U4DpT/1uaODSS91Hxu1cSxzd/Z50Qcy', '2017-06-02 22:03:55', '2017-06-02 22:03:55', 'teste@teste.com')